#+TITLE: main panel for org mode 
#+DESCRIPTION: this file is to track projects, track is NOT the main purpose. organizing is
#+TODO: READY PROGRESS(!) | COMP
#+TODO: TODO | DONE

**** TODO read javascript design pattern. 
     - State "DONE"       from "TODO"       [2017-03-08 Wed 17:24]
     - State "DONE"       from "TODO"       [2017-03-03 Fri 16:49]
     - State "DONE"       from "TODO"       [2017-03-01 Wed 17:26]
     - State "DONE"       from "TODO"       [2016-10-10 Mon 17:22]
     CLOCK: [2016-10-10 Mon 17:02]--[2016-10-10 Mon 17:22] =>  0:20
     - State "DONE"       from "TODO"       [2016-08-18 Thu 00:00]
     - State "DONE"       from "TODO"       [2016-08-16 Tue 22:04]
     - State "DONE"       from "TODO"       [2016-08-11 Thu 15:32]
     - State "DONE"       from "TODO"       [2016-08-08 Mon 01:32]
     - State "DONE"       from "TODO"       [2016-08-02 Tue 10:24]
     - State "DONE"       from "TODO"       [2016-07-27 Wed 10:49]
     - State "DONE"       from "TODO"       [2016-07-24 Sun 23:03]
     :PROPERTIES:
     :LAST_REPEAT: [2017-03-08 Wed 17:24]
     :CUSTOM_ID: jsdp
     :END:



**** TODO [#B] clean code review				     :review:
     SCHEDULED: <2017-07-05 Wed .+1m>
     - State "DONE"       from "TODO"       [2017-06-05 Mon 16:51]
     - State "DONE"       from "TODO"       [2017-04-24 Mon 17:59]
     - State "DONE"       from "TODO"       [2017-03-07 Tue 22:21]
     - State "DONE"       from "TODO"       [2016-10-31 Mon 18:32]
     - State "DONE"       from "TODO"       [2016-10-05 Wed 11:16]
     CLOCK: [2016-10-04 Tue 17:37]--[2016-10-05 Wed 11:16] => 17:39
     :PROPERTIES:
     :LAST_REPEAT: [2017-06-05 Mon 16:51]
     :END:
- watch video 
- summarize 


*** TODO read object oriented thought process			       :book:
    # SCHEDULED: <2016-08-26 Fri .+1w>
    - State "DONE"       from "TODO"       [2016-08-19 Fri 17:57]
    CLOCK: [2016-08-19 Fri 16:58]--[2016-08-19 Fri 17:57] =>  0:59
    - State "DONE"       from "TODO"       [2016-08-08 Mon 01:32]
    - State "DONE"       from "TODO"       [2016-07-29 Fri 15:55]
    CLOCK: [2016-07-29 Fri 15:44]--[2016-07-29 Fri 15:55] =>  0:11
    CLOCK: [2016-07-29 Fri 15:00]--[2016-07-29 Fri 15:14] =>  0:14
    - State "DONE"       from "TODO"       [2016-07-25 Mon 17:49]
    CLOCK: [2016-07-25 Mon 16:52]--[2016-07-25 Mon 17:48] =>  0:56
    - State "DONE"       from "TODO"       [2016-07-22 Fri 00:03]
    :PROPERTIES:
    :LAST_REPEAT: [2016-08-19 Fri 17:57]
    :END:

    

** TODO [#A] reflection, writing journal
   SCHEDULED: <2017-06-14 Wed .+3d/5d>
   - State "DONE"       from "TODO"       [2017-06-11 Sun 21:34]
   - State "DONE"       from "TODO"       [2017-06-05 Mon 22:06]
   - State "DONE"       from "TODO"       [2017-05-23 Tue 11:04]
   - State "DONE"       from "TODO"       [2017-05-20 Sat 11:28]
   - State "DONE"       from "TODO"       [2017-05-15 Mon 10:00]
   - State "DONE"       from "TODO"       [2017-05-01 Mon 11:54]
   - State "DONE"       from "TODO"       [2017-04-18 Tue 10:38]
   - State "DONE"       from "TODO"       [2017-04-12 Wed 22:59]
   - State "DONE"       from "TODO"       [2017-04-09 Sun 23:40]
   - State "DONE"       from "TODO"       [2017-04-04 Tue 11:22]
   - State "DONE"       from "TODO"       [2017-03-31 Fri 11:03]
   - State "DONE"       from "TODO"       [2017-03-27 Mon 00:35]
   - State "DONE"       from "TODO"       [2017-03-19 Sun 23:50]
   - State "DONE"       from "TODO"       [2017-03-07 Tue 22:26]
   - State "DONE"       from "TODO"       [2017-02-28 Tue 22:14]
   - State "DONE"       from "TODO"       [2017-02-20 Mon 22:15]
   - State "DONE"       from "TODO"       [2017-02-17 Fri 11:18]
   - State "DONE"       from "TODO"       [2017-02-13 Mon 10:35]
   - State "DONE"       from "TODO"       [2017-02-09 Thu 21:51]
   - State "DONE"       from "TODO"       [2017-02-06 Mon 20:55]
   - State "DONE"       from "TODO"       [2017-02-01 Wed 01:03]
   - State "DONE"       from "TODO"       [2017-01-29 Sun 21:10]
   - State "DONE"       from "TODO"       [2017-01-23 Mon 18:08]
   - State "DONE"       from "TODO"       [2017-01-20 Fri 17:57]
   - State "DONE"       from "TODO"       [2017-01-17 Tue 18:37]
   - State "DONE"       from "TODO"       [2017-01-12 Thu 00:49]
   - State "DONE"       from "TODO"       [2017-01-08 Sun 22:14]
   - State "DONE"       from "TODO"       [2016-12-30 Fri 21:37]
   - State "DONE"       from "TODO"       [2016-12-25 Sun 14:44]
   - State "DONE"       from "TODO"       [2016-12-08 Thu 09:51]
   - State "DONE"       from "TODO"       [2016-10-25 Tue 19:04]
   - State "DONE"       from "TODO"       [2016-10-17 Mon 22:52]
   - State "DONE"       from "TODO"       [2016-10-12 Wed 22:33]
   - State "DONE"       from "TODO"       [2016-10-07 Fri 17:48]
   - State "DONE"       from "TODO"       [2016-09-28 Wed 00:26]
   CLOCK: [2016-09-27 Tue 23:57]--[2016-09-28 Wed 00:26] =>  0:29
   - State "DONE"       from "PROGRESS"   [2016-09-27 Tue 17:35]
   - State "DONE"       from "TODO"       [2016-09-15 Thu 01:05]
   CLOCK: [2016-09-15 Thu 00:57]--[2016-09-15 Thu 01:05] =>  0:08
   - State "DONE"       from "TODO"       [2016-09-13 Tue 00:01]
   - State "DONE"       from "TODO"       [2016-09-13 Tue 00:01]
   CLOCK: [2016-09-12 Mon 22:28]--[2016-09-13 Tue 00:01] =>  1:33
   - State "DONE"       from "TODO"       [2016-09-07 Wed 00:01]
   - State "DONE"       from "TODO"       [2016-09-03 Sat 22:39]
   - State "DONE"       from "TODO"       [2016-09-02 Fri 12:03]
   - State "DONE"       from "TODO"       [2016-09-02 Fri 12:03]
   - State "DONE"       from "TODO"       [2016-08-23 Tue 23:46]
   CLOCK: [2016-08-23 Tue 23:35]--[2016-08-23 Tue 23:46] =>  0:11
   - State "DONE"       from "TODO"       [2016-08-22 Mon 21:04]
   CLOCK: [2016-08-22 Mon 20:53]--[2016-08-22 Mon 21:04] =>  0:11
   - State "DONE"       from "TODO"       [2016-08-21 Sun 22:36]
   CLOCK: [2016-08-21 Sun 22:24]--[2016-08-21 Sun 22:36] =>  0:12
   - State "DONE"       from "TODO"       [2016-08-16 Tue 23:30]
   CLOCK: [2016-08-16 Tue 23:05]--[2016-08-16 Tue 23:30] =>  0:25
   :PROPERTIES:
   :LAST_REPEAT: [2017-06-11 Sun 21:34]
   :STYLE:    habit
   :END:
:LAST_REPEAT: [2016-10-07 Fri 17:48]
- reading past journals
- writing journals 


** road map 
- for the first round, focus on medium problems 
- 2 problems each * 16 = 32 

| category         | round 1 (2) | round 2 | round 3 | total |
|------------------+-------------+---------+---------+-------|
| array            | X           |         |         |     2 |
| linked list      | X           |         |         |     2 |
| hash table       | X           |         |         |     2 |
| 2 points         | X           |         |         |     2 |
| binary search    | X           |         |         |     2 |
| tree             | X           |         |         |     2 |
| stack            | X           |         |         |     2 |
| heap             | X           |         |         |     2 |
| bit              |             |         |         |     0 |
| graph            |             |         |         |     0 |
|------------------+-------------+---------+---------+-------|
| math             |             |         |         |     0 |
| sort             |             |         |         |     0 |
| backtracking     |             |         |         |     0 |
| dp               |             |         |         |     0 |
| greedy           |             |         |         |     0 |
| divide & conquer |             |         |         |     0 |
|                  |             |         |         |     0 |
|------------------+-------------+---------+---------+-------|
| Total            |             |         |         |    16 |
#+TBLFM: $5='( + (if (string= $2 "X") 2 0) (if (string= $3 "X") 1 0) (if (string= $4 "X") 1 0))::@19$5=vsum(@2$5..@18$5)


*** TODO [#C] leetcode 2 problems medium
    SCHEDULED: <2017-06-16 Fri .+2d>
    - State "DONE"       from "TODO"       [2017-06-14 Wed 10:14]
    - State "DONE"       from "TODO"       [2017-06-11 Sun 21:29]
    - State "DONE"       from "TODO"       [2017-06-08 Thu 18:01]
    - State "DONE"       from "TODO"       [2017-06-06 Tue 18:20]
    - State "DONE"       from "TODO"       [2017-02-28 Tue 22:07]
    - State "DONE"       from "TODO"       [2017-02-28 Tue 00:19]
    - State "DONE"       from "TODO"       [2016-12-22 Thu 11:34]
    - State "DONE"       from "TODO"       [2016-10-28 Fri 18:46]
    - State "DONE"       from "TODO"       [2016-10-27 Thu 18:46]
    - State "DONE"       from "TODO"       [2016-10-26 Wed 10:22]
    - State "DONE"       from "TODO"       [2016-10-24 Mon 20:01]
    - State "DONE"       from "TODO"       [2016-10-18 Tue 18:49]
    - State "DONE"       from "TODO"       [2016-10-17 Mon 22:48]
    - State "DONE"       from "TODO"       [2016-10-12 Wed 13:13]
    - State "DONE"       from "TODO"       [2016-10-11 Tue 18:20]
    - State "DONE"       from "TODO"       [2016-09-14 Wed 17:58]
    CLOCK: [2016-09-14 Wed 17:35]--[2016-09-14 Wed 17:58] =>  0:23
    - State "DONE"       from "TODO"       [2016-08-22 Mon 21:36]
    - State "DONE"       from "TODO"       [2016-08-10 Wed 22:19]
    - State "DONE"       from "TODO"       [2016-08-08 Mon 01:33]
    - State "DONE"       from "TODO"       [2016-08-03 Wed 17:18]
    - State "DONE"       from "TODO"       [2016-07-22 Fri 11:17]
    - State "DONE"       from "TODO"       [2016-06-14 Tue 19:01]
    :PROPERTIES:
    :LAST_REPEAT: [2017-06-14 Wed 10:14]
    :STYLE:    habit
    :CUSTOM_ID: lc1
    :END:      

